tap 'caskroom/cask'
tap 'caskroom/cask-versions'
tap 'caskroom/core'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'aria2'
brew 'bat'
brew 'coreutils'
brew 'git'
brew 'fzf'
brew 'mackup'
brew 'mas'
brew 'nginx'
brew 'node'
brew 'ripgrep'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'yarn'
brew 'youtube-dl'
brew 'zplug'
brew 'zsh'

cask 'alfred'
cask 'appcleaner'
cask 'atom'
cask 'calibre'
cask 'cocoapods-app'
cask 'dropbox'
cask 'filezilla'
cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'hypeswitch'
cask 'iina'
cask 'iterm2'
cask 'nvalt'
cask 'plex-media-server'
cask 'sequel-pro'
cask 'sketch'
cask 'skype'
cask 'slate'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'wwdc'

cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Reeder', id: 880001334
mas 'WeChat', id: 836500024
mas 'Xcode', id: 497799835